<?php
define("DEFAULT_PHAR_ID", 100);
define("DEFAULT_UNT_PHAR_ID", 9999999999);
define("DEFAULT_FAC_ID", 101);
define("ADJUSTED_TIMING", [
    "起床時薬" => ["おきた時", "起床時"],
    "15時" => ["１５時", "１５時に服用"],
    "朝食前" => [
        "朝食前３０分",
        "あさ食前",
        "あさ食前３０分"
    ],
    "朝食後" => [
        "朝食後３０分",
        "あさ食後",
        "あさ食後３０分"
    ],
    "昼食前" =>
    [
        "昼食前３０分",
        "ひる食前",
        "ひる食前３０分"
    ],
    "朝食間" =>
    [
        "あさ食間",
        "あさ食後２時間"
    ],
    "昼食後" => [
        "昼食後３０分",
        "ひる食後",
        "ひる食後３０分"
    ],
    "夕食前" =>
    [
        "夕食前３０分",
        "ゆう食前",
        "ゆう食前３０分"
    ],
    "夕食後" => [
        "夕食後３０分",
        "ゆう食後",
        "ゆう食後３０分"
    ],
    "寝る前" =>
    [
        "眠前",
        "ねる前"
    ],
    "昼食間" =>
    [
        "朝食後２時間",
        "昼食間",
        "昼食後２時間",
        "ひる食間",
        "ひる食後２時間"
    ],
    "夕食間" =>
    [
        "夕食後２時間",
        "ゆう食間",
        "ゆう食後２時間"
    ],
    "夕食直後" => ["ゆう食直後"],
    "朝食直前" => ["あさ食直前"],
    "朝食直後" => ["あさ食直後"],
    "昼食直前" => ["ひる食直前"],
    "昼食直後" => ["ひる食直後"],
    "夕食直前" => ["ゆう食直前"],
    "9時" => ["９時に服用"],
    "14時" => ["１４時"],
    "15時30分" => ["１５時半"],
]);
